Ran Plan for 7 projects:

1. project: `bootstrap-prod` dir: `terraform/bootstrap` workspace: `default`
1. project: `rds-prod` dir: `terraform/rds` workspace: `default`
1. project: `logging-prod` dir: `terraform/logging` workspace: `default`
1. project: `route53-prod` dir: `terraform/route53` workspace: `default`
1. project: `acm-prod` dir: `terraform/acm` workspace: `default`
1. project: `atlantis-prod` dir: `terraform/atlantis` workspace: `default`
1. project: `ecr-fileflow-prod` dir: `terraform/ecr/fileflow` workspace: `default`
---

### 1. project: `bootstrap-prod` dir: `terraform/bootstrap` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 init -input=false -upgrade" in "/home/atlantis/.atlantis/repos/ryu-qqq/Infrastructure/67/default/terraform/bootstrap": exit status 1

Initializing the backend...

Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Installing hashicorp/aws v5.100.0...
╷
│ Error: Failed to install provider
│ 
│ Error while installing hashicorp/aws v5.100.0: chmod
│ .terraform/providers/registry.terraform.io/hashicorp/aws/5.100.0/linux_amd64/terraform-provider-aws_v5.100.0_x5:
│ no such file or directory
╵


```
</details>

---
### 2. project: `rds-prod` dir: `terraform/rds` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_db_instance.main will be created
+ resource "aws_db_instance" "main" {
      + address                               = (known after apply)
      + allocated_storage                     = 30
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 14
      + backup_target                         = (known after apply)
      + backup_window                         = "03:00-04:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = true
      + database_insights_mode                = (known after apply)
      + db_name                               = "shared_db"
      + db_subnet_group_name                  = "prod-shared-mysql-subnet-group"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = true
      + domain_fqdn                           = (known after apply)
      + enabled_cloudwatch_logs_exports       = [
          + "error",
          + "general",
          + "slowquery",
        ]
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "8.0.42"
      + engine_version_actual                 = (known after apply)
      + final_snapshot_identifier             = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "prod-shared-mysql"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t4g.small"
      + iops                                  = (known after apply)
      + kms_key_id                            = "arn:aws:kms:ap-northeast-2:646886795421:key/4917edae-ce91-4e8c-ab4d-8218115ff3ae"
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = "mon:04:00-mon:05:00"
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 200
      + monitoring_interval                   = 60
      + monitoring_role_arn                   = "arn:aws:iam::646886795421:role/prod-shared-mysql-monitoring-role"
      + multi_az                              = true
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "prod-shared-mysql-params"
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 3306
      + publicly_accessible                   = false
      + region                                = "ap-northeast-2"
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = false
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp3"
      + tags                                  = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "sensitive"
          + "Description" = "Shared MySQL database for multiple services"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "prod-shared-mysql"
          + "Owner"       = "fbtkdals2@naver.com"
          + "Project"     = "shared-infrastructure"
          + "Service"     = "shared-database"
          + "Stack"       = "rds"
          + "Team"        = "platform-team"
        }
      + tags_all                              = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "sensitive"
          + "Description" = "Shared MySQL database for multiple services"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "prod-shared-mysql"
          + "Owner"       = "fbtkdals2@naver.com"
          + "Project"     = "shared-infrastructure"
          + "Service"     = "shared-database"
          + "Stack"       = "rds"
          + "Team"        = "platform-team"
        }
      + timezone                              = (known after apply)
      + username                              = "admin"
      + vpc_security_group_ids                = [
          + "sg-0d9b6f65239b16b44",
        ]
    }

  # aws_db_parameter_group.main will be updated in-place
~ resource "aws_db_parameter_group" "main" {
        id           = "prod-shared-mysql-params"
        name         = "prod-shared-mysql-params"
        tags         = {
            "CostCenter"  = "engineering"
            "DataClass"   = "sensitive"
            "Description" = "Shared MySQL database for multiple services"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "Terraform"
            "Name"        = "prod-shared-mysql-params"
            "Owner"       = "fbtkdals2@naver.com"
            "Project"     = "shared-infrastructure"
            "Service"     = "shared-database"
            "Stack"       = "rds"
            "Team"        = "platform-team"
        }
        # (7 unchanged attributes hidden)

      - parameter {
          - apply_method = "pending-reboot" -> null
          - name         = "innodb_buffer_pool_size" -> null
          - value        = "{DBInstanceClassMemory*3/4}" -> null
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "innodb_buffer_pool_size"
          + value        = "{DBInstanceClassMemory*3/4}"
        }

        # (6 unchanged blocks hidden)
    }

  # aws_ssm_parameter.db-instance-address will be updated in-place
~ resource "aws_ssm_parameter" "db-instance-address" {
        id              = "/shared/rds/db-instance-address"
        name            = "/shared/rds/db-instance-address"
        tags            = {
            "Component"   = "rds"
            "CostCenter"  = "engineering"
            "DataClass"   = "sensitive"
            "Description" = "Shared MySQL database for multiple services"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "Terraform"
            "Name"        = "db-instance-address-export"
            "Owner"       = "fbtkdals2@naver.com"
            "Project"     = "shared-infrastructure"
            "Service"     = "shared-database"
            "Stack"       = "rds"
            "Team"        = "platform-team"
        }
      ~ value           = (sensitive value)
      ~ version         = 1 -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

Changes to Outputs:
~ availability_zone            = "ap-northeast-2b" -> (known after apply)
~ connection_string_example    = "mysql://admin:<password>@prod-shared-mysql.cfacertspqbw.ap-northeast-2.rds.amazonaws.com:3306/shared_db" -> (known after apply)
~ db_instance_address          = "prod-shared-mysql.cfacertspqbw.ap-northeast-2.rds.amazonaws.com" -> (known after apply)
~ db_instance_arn              = "arn:aws:rds:ap-northeast-2:646886795421:db:prod-shared-mysql" -> (known after apply)
~ db_instance_endpoint         = "prod-shared-mysql.cfacertspqbw.ap-northeast-2.rds.amazonaws.com:3306" -> (known after apply)
~ db_instance_resource_id      = "db-4YI333LTEWMUU3GBWYCGFL35LY" -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p rds-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FInfrastructure%252Fterraform%252Frds%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p rds-prod
  ```
Plan: 1 to add, 2 to change, 0 to destroy.

---
### 3. project: `logging-prod` dir: `terraform/logging` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/Infrastructure/67/default/terraform/logging/logging-prod-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/Infrastructure/67/default/terraform/logging": exit status 1
data.terraform_remote_state.kms: Reading...

Planning failed. Terraform encountered an error while generating this plan.

╷
│ Error: Error loading state error
│ 
│   with data.terraform_remote_state.kms,
│   on main.tf line 10, in data "terraform_remote_state" "kms":
│   10:   backend = "s3"
│ 
│ error loading the remote state: Unable to list objects in S3 bucket
│ "terraform-state-bucket" with prefix "env:/": operation error S3:
│ ListObjectsV2, https response error StatusCode: 301, RequestID:
│ PBD74Y9M1PVY5TB0, HostID:
│ FBHABIJstOcurJ5o3pszoAGKDWoYI1tZtQZ62U1LRAsgjp6ogTAND4EUOakPQ3MGIkUHp/YOeTyg3BvEvPQ6Sm3+M+SVEEXgMBQL4AXJSIQ=,
│ requested bucket from "ap-northeast-2", actual location "us-east-1"
╵


```
</details>

---
### 4. project: `route53-prod` dir: `terraform/route53` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_iam_policy_document.route53-logs-kms[0]: Reading...
data.aws_iam_policy_document.route53-logs-kms[0]: Read complete after 0s [id=1046135945]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.route53-query-logs[0] will be created
+ resource "aws_cloudwatch_log_group" "route53-query-logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/route53/set-of.com"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Component"   = "dns-logging"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "public"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "Name"        = "route53-query-logs-set-of.com"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "dns"
          + "Team"        = "platform-team"
        }
      + tags_all          = {
          + "Component"   = "dns-logging"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "public"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "route53-query-logs-set-of.com"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "dns"
          + "Team"        = "platform-team"
        }
    }

  # aws_kms_alias.route53-logs[0] will be created
+ resource "aws_kms_alias" "route53-logs" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/route53-logs"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.route53-logs[0] will be created
+ resource "aws_kms_key" "route53-logs" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 30
      + description                        = "KMS key for Route53 query logs encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::646886795421:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt",
                          + "kms:DescribeKey",
                          + "kms:Decrypt",
                          + "kms:CreateGrant",
                        ]
                      + Condition = {
                          + ArnLike = {
                              + "kms:EncryptionContext:aws:logs:arn" = "arn:aws:logs:ap-northeast-2:646886795421:log-group:/aws/route53/*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "logs.ap-northeast-2.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow CloudWatch Logs"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Component"   = "kms"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "public"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "Name"        = "route53-logs-encryption"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "dns"
          + "Team"        = "platform-team"
        }
      + tags_all                           = {
          + "Component"   = "kms"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "public"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "route53-logs-encryption"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "dns"
          + "Team"        = "platform-team"
        }
    }

  # aws_route53_health_check.atlantis will be created
+ resource "aws_route53_health_check" "atlantis" {
      + arn               = (known after apply)
      + disabled          = false
      + enable_sni        = (known after apply)
      + failure_threshold = 3
      + fqdn              = "atlantis.set-of.com"
      + id                = (known after apply)
      + measure_latency   = false
      + port              = 443
      + request_interval  = 30
      + resource_path     = "/healthz"
      + tags              = {
          + "Component"   = "health-monitoring"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "public"
          + "Endpoint"    = "atlantis.set-of.com"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "Name"        = "healthcheck-atlantis-set-of.com"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "dns"
          + "Team"        = "platform-team"
        }
      + tags_all          = {
          + "Component"   = "health-monitoring"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "public"
          + "Endpoint"    = "atlantis.set-of.com"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "healthcheck-atlantis-set-of.com"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "dns"
          + "Team"        = "platform-team"
        }
      + triggers          = (known after apply)
      + type              = "HTTPS"
    }

  # aws_route53_query_log.primary[0] will be created
+ resource "aws_route53_query_log" "primary" {
      + arn                      = (known after apply)
      + cloudwatch_log_group_arn = (known after apply)
      + id                       = (known after apply)
      + zone_id                  = (known after apply)
    }

  # aws_route53_zone.primary will be created
+ resource "aws_route53_zone" "primary" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform - set-of.com DNS zone"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "set-of.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags                = {
          + "Component"   = "route53"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "public"
          + "Domain"      = "set-of.com"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "Name"        = "route53-set-of.com"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "dns"
          + "Team"        = "platform-team"
        }
      + tags_all            = {
          + "Component"   = "route53"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "public"
          + "Domain"      = "set-of.com"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "route53-set-of.com"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "dns"
          + "Team"        = "platform-team"
        }
      + zone_id             = (known after apply)
    }

  # aws_ssm_parameter.hosted-zone-id will be created
+ resource "aws_ssm_parameter" "hosted-zone-id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Route53 Hosted Zone ID for set-of.com"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/shared/route53/hosted-zone-id"
      + tags           = {
          + "Component"   = "parameter-store"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "public"
          + "Environment" = "prod"
          + "Export"      = "hosted-zone-id"
          + "Lifecycle"   = "production"
          + "Name"        = "ssm-route53-zone-id"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "dns"
          + "Team"        = "platform-team"
        }
      + tags_all       = {
          + "Component"   = "parameter-store"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "public"
          + "Environment" = "prod"
          + "Export"      = "hosted-zone-id"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ssm-route53-zone-id"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "dns"
          + "Team"        = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ atlantis_health_check_id = (known after apply)
+ hosted_zone_id           = (known after apply)
+ hosted_zone_name         = "set-of.com"
+ name_servers             = (known after apply)
+ query_log_group_arn      = (known after apply)
+ query_log_group_name     = "/aws/route53/set-of.com"
+ zone_arn                 = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p route53-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FInfrastructure%252Fterraform%252Froute53%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p route53-prod
  ```
Plan: 7 to add, 0 to change, 0 to destroy.

---
### 5. project: `acm-prod` dir: `terraform/acm` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_acm_certificate.wildcard will be created
+ resource "aws_acm_certificate" "wildcard" {
      + arn                       = (known after apply)
      + domain_name               = "set-of.com"
      + domain_validation_options = [
          + {
              + domain_name           = "*.set-of.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "set-of.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.set-of.com",
          + "set-of.com",
        ]
      + tags                      = {
          + "Component"   = "acm"
          + "CostCenter"  = "infrastructure"
          + "Domain"      = "set-of.com"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "acm-wildcard-set-of.com"
          + "Owner"       = "fbtkdals2@naver.com"
          + "Project"     = "infrastructure"
          + "Service"     = "certificate-management"
          + "Team"        = "platform-team"
          + "Type"        = "wildcard"
        }
      + tags_all                  = {
          + "Component"   = "acm"
          + "CostCenter"  = "infrastructure"
          + "Domain"      = "set-of.com"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "acm-wildcard-set-of.com"
          + "Owner"       = "fbtkdals2@naver.com"
          + "Project"     = "infrastructure"
          + "Service"     = "certificate-management"
          + "Team"        = "platform-team"
          + "Type"        = "wildcard"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.wildcard will be created
+ resource "aws_acm_certificate_validation" "wildcard" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)

      + timeouts {
          + create = "10m"
        }
    }

  # aws_cloudwatch_metric_alarm.certificate-expiration[0] will be created
+ resource "aws_cloudwatch_metric_alarm" "certificate-expiration" {
      + actions_enabled                       = true
      + alarm_description                     = "ACM certificate for set-of.com is expiring in less than 30 days"
      + alarm_name                            = "acm-certificate-expiration-set-of.com"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "days-to-expiry"
      + namespace                             = "AWS/CertificateManager"
      + period                                = 86400
      + statistic                             = "Minimum"
      + tags                                  = {
          + "Component"   = "monitoring"
          + "CostCenter"  = "infrastructure"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "alarm-acm-expiration-set-of.com"
          + "Owner"       = "fbtkdals2@naver.com"
          + "Project"     = "infrastructure"
          + "Service"     = "certificate-management"
          + "Team"        = "platform-team"
        }
      + tags_all                              = {
          + "Component"   = "monitoring"
          + "CostCenter"  = "infrastructure"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "alarm-acm-expiration-set-of.com"
          + "Owner"       = "fbtkdals2@naver.com"
          + "Project"     = "infrastructure"
          + "Service"     = "certificate-management"
          + "Team"        = "platform-team"
        }
      + threshold                             = 30
      + treat_missing_data                    = "notBreaching"
    }

  # aws_route53_record.certificate-validation["*.set-of.com"] will be created
+ resource "aws_route53_record" "certificate-validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z104656329CL6XBYE8OIJ"
    }

  # aws_route53_record.certificate-validation["set-of.com"] will be created
+ resource "aws_route53_record" "certificate-validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z104656329CL6XBYE8OIJ"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ certificate_arn                       = (known after apply)
+ certificate_domain_name               = "set-of.com"
+ certificate_id                        = (known after apply)
+ certificate_not_after                 = (known after apply)
+ certificate_not_before                = (known after apply)
+ certificate_status                    = (known after apply)
+ certificate_subject_alternative_names = [
      + "*.set-of.com",
      + "set-of.com",
    ]
+ certificate_validation_method         = "DNS"
+ expiration_alarm_arn                  = (known after apply)
+ validation_record_fqdns               = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p acm-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FInfrastructure%252Fterraform%252Facm%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p acm-prod
  ```
Plan: 5 to add, 0 to change, 0 to destroy.

---
### 6. project: `atlantis-prod` dir: `terraform/atlantis` workspace: `default`
**Plan Failed**: This project is currently locked by an unapplied plan from pull #69. To continue, delete the lock from #69 or apply that plan and merge the pull request.

Once the lock is released, comment `atlantis plan` here to re-plan.

---
### 7. project: `ecr-fileflow-prod` dir: `terraform/ecr/fileflow` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.fileflow must be replaced
-/+ resource "aws_ecr_lifecycle_policy" "fileflow" {
      ~ id          = "fileflow" -> (known after apply)
      ~ policy      = jsonencode(
          ~ {
              ~ rules = [
                  ~ {
                      ~ description  = "최근 10개 이미지만 유지" -> "Keep last 30 images"
                      ~ selection    = {
                          ~ countNumber   = 10 -> 30
                          ~ tagPrefixList = [
                                "v",
                              - "prod-",
                              - "release-",
                            ]
                            # (2 unchanged attributes hidden)
                        }
                        # (2 unchanged attributes hidden)
                    },
                  ~ {
                      ~ description  = "태그 없는 이미지 7일 후 삭제" -> "Remove untagged images older than 7 days"
                        # (3 unchanged attributes hidden)
                    },
                ]
            } # forces replacement
        )
      ~ registry_id = "646886795421" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_ecr_repository.fileflow will be updated in-place
~ resource "aws_ecr_repository" "fileflow" {
        id                   = "fileflow"
        name                 = "fileflow"
      ~ tags                 = {
            "Component"   = "container-registry"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "Name"        = "ecr-fileflow"
            "Owner"       = "fbtkdals2@naver.com"
          - "Project"     = "fileflow" -> null
            "Service"     = "fileflow"
        }
      ~ tags_all             = {
          - "Project"     = "fileflow" -> null
            # (10 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_ecr_repository_policy.fileflow will be updated in-place
~ resource "aws_ecr_repository_policy" "fileflow" {
        id          = "fileflow"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = [
                            # (6 unchanged elements hidden)
                            "ecr:CompleteLayerUpload",
                          + "ecr:DescribeRepositories",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:ListImages",
                          + "ecr:DescribeImages",
                        ]
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::646886795421:role/GitHubActionsRole" -> [
                              + "arn:aws:iam::646886795421:root",
                            ]
                        }
                      ~ Sid       = "AllowGitHubActions" -> "AllowPushPull"
                        # (1 unchanged attribute hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p ecr-fileflow-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FInfrastructure%252Fterraform%252Fecr%252Ffileflow%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p ecr-fileflow-prod
  ```
Plan: 1 to add, 2 to change, 1 to destroy.

---
### Plan Summary

7 projects, 4 with changes, 0 with no changes, 3 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```